plotting-data/slides.org
#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]
#+BEAMER_FRAME_LEVEL: 1

#+BEAMER_HEADER_EXTRA: \usetheme{Warsaw}\usecolortheme{default}\useoutertheme{infolines}\setbeamercovered{transparent}
#+COLUMNS: %45ITEM %10BEAMER_env(Env) %10BEAMER_envargs(Env Args) %4BEAMER_col(Col) %8BEAMER_extra(Extra)
#+PROPERTY: BEAMER_col_ALL 0.1 0.2 0.3 0.4 0.5 0.6 0.7 0.8 0.9 1.0 :ETC

#+LaTeX_CLASS: beamer
#+LaTeX_CLASS_OPTIONS: [presentation]

#+LaTeX_HEADER: \usepackage[english]{babel} \usepackage{ae,aecompl}
#+LaTeX_HEADER: \usepackage{mathpazo,courier,euler} \usepackage[scaled=.95]{helvet}

#+LaTeX_HEADER: \usepackage{listings}

#+LaTeX_HEADER:\lstset{language=Python, basicstyle=\ttfamily\bfseries,
#+LaTeX_HEADER:  commentstyle=\color{red}\itshape, stringstyle=\color{darkgreen},
#+LaTeX_HEADER:  showstringspaces=false, keywordstyle=\color{blue}\bfseries}

#+TITLE: Plotting Experimental Data
#+AUTHOR: FOSSEE
#+DATE: 2010-09-14 Tue
#+EMAIL:     info@fossee.in

#+DESCRIPTION: 
#+KEYWORDS: 
#+LANGUAGE:  en
#+OPTIONS:   H:3 num:nil toc:nil \n:nil @:t ::t |:t ^:t -:t f:t *:t <:t
#+OPTIONS:   TeX:t LaTeX:nil skip:nil d:nil todo:nil pri:nil tags:not-in-toc

* Outline 
   - Defining sequence of numbers
   - Squaring sequence of numbers
   - Plotting Data Points
   - Indicating Error through Errorbars

* Simple Pendulum Data

#+ORGTBL: L vs T^2 orgtbl-to-latex

  | L   | T    |
  | 0.1 | 0.69 |
  | 0.2 | 0.90 |
  | 0.3 | 1.19 |
  | 0.4 | 1.30 |
  | 0.5 | 1.47 |
  | 0.6 | 1.58 |
  | 0.7 | 1.77 |
  | 0.8 | 1.83 |
  | 0.9 | 1.94 |
  

* Initializing L & T
  : L = [0.1, 0.2, 0.3, 0.4, 0.5,
  :      0.6, 0.7, 0.8, 0.9]
  : t = [0.69, 0.90, 1.19,
  :      1.30, 1.47, 1.58,
  :      1.77, 1.83, 1.94]



* Question 1
  - Plot the given experimental data with large dots.
  The data is on your screen.     
  

* Question 1 Data

#+ORGTBL: L vs T^2 orgtbl-to-latex
    
  
   |    S |     n |
   | 0.19 | 10.74 |
   | 0.38 | 14.01 |
   | 0.57 | 18.52 |
   | 0.77 | 20.23 |
   | 0.96 | 22.88 |
   | 1.15 | 24.59 |
   | 1.34 | 27.55 |
   | 1.54 | 28.48 |
   | 1.73 | 30.20 |
    

* Solution 1

  : S=[0.19,0.38,0.57,0.77,0.96,
  :   1.15,1.34,1.54,1.73]
  : n=[10.74,14.01,18.52,20.23,
  :    22.88,24.59,27.55,28.48,30.20]
  : plot(S,n,'o')

* Question 2
  - Plot the given experimental data with small dots.
  The data is on your screen.     

* Question 2 Data

#+ORGTBL: L vs T^2 orgtbl-to-latex

   |    P |    D |
   | 1.48 | 0.68 |
   | 2.96 | 0.89 |
   | 4.44 | 1.18 |
   | 5.92 | 1.29 |
   | 7.40 | 1.46 |
   | 8.88 | 1.57 |
   | 10.3 | 1.76 |
   | 11.8 | 1.82 |
   | 13.3 | 1.93 |
  
* Solution 2

   : P=[1.48,2.96,4.44,5.92,7.40,
   :   8.88,10.3,11.8,13.3]
   : D=[0.68,0.89,1.18,1.29,1.46,
   :   1.57,1.76,1.82,1.93]
   : plot(P,D,'.')

* Adding Error 

#+ORGTBL: L vs T^2 orgtbl-to-latex

  |   L |    T | \delta L | \delta T |
  | 0.1 | 0.69 |     0.08 |     0.04 |
  | 0.2 | 0.90 |     0.09 |     0.08 |
  | 0.3 | 1.19 |     0.07 |     0.03 |
  | 0.4 | 1.30 |     0.05 |     0.05 |
  | 0.5 | 1.47 |     0.06 |     0.03 |
  | 0.6 | 1.58 |     0.00 |     0.03 |
  | 0.7 | 1.77 |     0.06 |     0.04 |
  | 0.8 | 1.83 |     0.06 |     0.07 |
  | 0.9 | 1.94 |     0.01 |     0.08 |
 
 
* Plotting Error bar 
  
  : errorbar(L,tsquare,xerr=delta_L, yerr=delta_T,
  :         fmt='b.')


* Question 1

  - Plot the given experimental data with large green dots.Also include
  the error in your plot. 

  
* Question 1 Data

  #+ORGTBL: L vs T^2 orgtbl-to-latex

  |    S |     n | \delta S | \delta n |
  | 0.19 | 10.74 |    0.006 |     0.61 |
  | 0.38 | 14.01 |    0.006 |     0.69 |
  | 0.57 | 18.52 |    0.005 |     0.53 |
  | 0.77 | 20.23 |    0.003 |     0.38 |
  | 0.96 | 22.88 |    0.004 |     0.46 |
  | 1.15 | 24.59 |    0.007 |     0.37 |
  | 1.34 | 27.55 |    0.004 |     0.46 |
  | 1.54 | 28.48 |    0.004 |     0.46 |
  | 1.73 | 30.20 |    0.007 |     0.37 |
  
  
    

* Solution 1
  
  : S=[0.19,0.38,0.57,0.77,0.96,
  :   1.15,1.34,1.54,1.73]
  : n=[10.74,14.01,18.52,20.23,
  :   22.88,24.59,27.55,28.48,30.20]
  : delta_S=[0.006,0.006,0.005,0.003,
  :         0.004,0.007,0.004,0.004,0.007]
  : delta_n=[0.61,0.69,0.53,0.38,0.46,
  :         0.37,0.46,0.46,0.37]
  : errorbar(S,n,xerr=delta_S, yerr=delta_n, 
  :         fmt='go')

* Summary 
 : L = [0.1, 0.2, 0.3, 0.4, 0.5,
 :      0.6, 0.7, 0.8, 0.9]  
 : plot(x,y,'o')
 : plot(x,y,'.')
* Thank you!
#+begin_latex                                                                                                                                                
  \begin{block}{}                                                                                                                                            
  \begin{center}                                                                                                                                             
  This spoken tutorial has been produced by the                                                                                                              
  \textcolor{blue}{FOSSEE} team, which is funded by the                                                                                                      
  \end{center}                                                                                                                                               
  \begin{center}                                                                                                                                             
    \textcolor{blue}{National Mission on Education through \\                                                                                                
      Information \& Communication Technology \\                                                                                                             
      MHRD, Govt. of India}.                                                                                                                                 
  \end{center}                                                                                                                                               
  \end{block}                                                                                                                                                
#+end_latex



