plotting_data/slides.tex
% Created 2010-11-10 Wed 02:09
\documentclass[presentation]{beamer}
\usepackage[latin1]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{soul}
\usepackage{t1enc}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{latexsym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\usepackage[english]{babel} \usepackage{ae,aecompl}
\usepackage{mathpazo,courier,euler} \usepackage[scaled=.95]{helvet}
\usepackage{listings}
\lstset{language=Python, basicstyle=\ttfamily\bfseries,
commentstyle=\color{red}\itshape, stringstyle=\color{darkgreen},
showstringspaces=false, keywordstyle=\color{blue}\bfseries}
\providecommand{\alert}[1]{\textbf{#1}}

\title{Plotting Experimental Data}
\author{FOSSEE}
\date{2010-09-14 Tue}

\usetheme{Warsaw}\usecolortheme{default}\useoutertheme{infolines}\setbeamercovered{transparent}
\begin{document}

\maketitle









\begin{frame}
\frametitle{Outline}
\label{sec-1}

\begin{itemize}
\item Defining sequence of numbers
\item Squaring sequence of numbers
\item Plotting Data Points
\item Indicating Error through Errorbars
\end{itemize}
\end{frame}
\begin{frame}
\frametitle{Simple Pendulum Data}
\label{sec-2}




\begin{center}
\begin{tabular}{rr}
   L  &     T  \\
 0.1  &  0.69  \\
 0.2  &  0.90  \\
 0.3  &  1.19  \\
 0.4  &  1.30  \\
 0.5  &  1.47  \\
 0.6  &  1.58  \\
 0.7  &  1.77  \\
 0.8  &  1.83  \\
 0.9  &  1.94  \\
\end{tabular}
\end{center}


  
\end{frame}
\begin{frame}[fragile]
\frametitle{Initializing L \& T}
\label{sec-3}

\begin{verbatim}
   L = [0.1, 0.2, 0.3, 0.4, 0.5,
        0.6, 0.7, 0.8, 0.9]
   t = [0.69, 0.90, 1.19,
        1.30, 1.47, 1.58,
        1.77, 1.83, 1.94]
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Question 1}
\label{sec-4}

\begin{itemize}
\item Plot the given experimental data with large dots.
\end{itemize}

  The data is on your screen.     
  
\end{frame}
\begin{frame}
\frametitle{Question 1 Data}
\label{sec-5}


    
  

\begin{center}
\begin{tabular}{rr}
    S  &      n  \\
 0.19  &  10.74  \\
 0.38  &  14.01  \\
 0.57  &  18.52  \\
 0.77  &  20.23  \\
 0.96  &  22.88  \\
 1.15  &  24.59  \\
 1.34  &  27.55  \\
 1.54  &  28.48  \\
 1.73  &  30.20  \\
\end{tabular}
\end{center}


    
\end{frame}
\begin{frame}[fragile]
\frametitle{Solution 1}
\label{sec-6}


\begin{verbatim}
   S=[0.19,0.38,0.57,0.77,0.96,
     1.15,1.34,1.54,1.73]
   n=[10.74,14.01,18.52,20.23,
      22.88,24.59,27.55,28.48,30.20]
   plot(S,n,'o')
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Question 2}
\label{sec-7}

\begin{itemize}
\item Plot the given experimental data with small dots.
\end{itemize}

  The data is on your screen.     
\end{frame}
\begin{frame}
\frametitle{Question 2 Data}
\label{sec-8}




\begin{center}
\begin{tabular}{rr}
    P  &     D  \\
 1.48  &  0.68  \\
 2.96  &  0.89  \\
 4.44  &  1.18  \\
 5.92  &  1.29  \\
 7.40  &  1.46  \\
 8.88  &  1.57  \\
 10.3  &  1.76  \\
 11.8  &  1.82  \\
 13.3  &  1.93  \\
\end{tabular}
\end{center}


  
\end{frame}
\begin{frame}[fragile]
\frametitle{Solution 2}
\label{sec-9}


\begin{verbatim}
    P=[1.48,2.96,4.44,5.92,7.40,
      8.88,10.3,11.8,13.3]
    D=[0.68,0.89,1.18,1.29,1.46,
      1.57,1.76,1.82,1.93]
    plot(P,D,'.')
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Adding Error}
\label{sec-10}




\begin{center}
\begin{tabular}{rrrr}
   L  &     T  &  $\delta$ L  &  $\delta$ T  \\
 0.1  &  0.69  &        0.08  &        0.04  \\
 0.2  &  0.90  &        0.09  &        0.08  \\
 0.3  &  1.19  &        0.07  &        0.03  \\
 0.4  &  1.30  &        0.05  &        0.05  \\
 0.5  &  1.47  &        0.06  &        0.03  \\
 0.6  &  1.58  &        0.00  &        0.03  \\
 0.7  &  1.77  &        0.06  &        0.04  \\
 0.8  &  1.83  &        0.06  &        0.07  \\
 0.9  &  1.94  &        0.01  &        0.08  \\
\end{tabular}
\end{center}


 
 
\end{frame}
\begin{frame}[fragile]
\frametitle{Plotting Error bar}
\label{sec-11}

  
\begin{verbatim}
   errorbar(L,tsquare,xerr=delta_L, yerr=delta_T,
           fmt='b.')
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Question 1}
\label{sec-12}


\begin{itemize}
\item Plot the given experimental data with large green dots.Also include
\end{itemize}

  the error in your plot. 

  
\end{frame}
\begin{frame}
\frametitle{Question 1 Data}
\label{sec-13}


  \#+ORGTBL: L vs T$^2$ orgtbl-to-latex


\begin{center}
\begin{tabular}{rrrr}
    S  &      n  &  $\delta$ S  &  $\delta$ n  \\
 0.19  &  10.74  &       0.006  &        0.61  \\
 0.38  &  14.01  &       0.006  &        0.69  \\
 0.57  &  18.52  &       0.005  &        0.53  \\
 0.77  &  20.23  &       0.003  &        0.38  \\
 0.96  &  22.88  &       0.004  &        0.46  \\
 1.15  &  24.59  &       0.007  &        0.37  \\
 1.34  &  27.55  &       0.004  &        0.46  \\
 1.54  &  28.48  &       0.004  &        0.46  \\
 1.73  &  30.20  &       0.007  &        0.37  \\
\end{tabular}
\end{center}


  
  
    
\end{frame}
\begin{frame}[fragile]
\frametitle{Solution 1}
\label{sec-14}

  
\begin{verbatim}
   S=[0.19,0.38,0.57,0.77,0.96,
     1.15,1.34,1.54,1.73]
   n=[10.74,14.01,18.52,20.23,
     22.88,24.59,27.55,28.48,30.20]
   delta_S=[0.006,0.006,0.005,0.003,
           0.004,0.007,0.004,0.004,0.007]
   delta_n=[0.61,0.69,0.53,0.38,0.46,
           0.37,0.46,0.46,0.37]
   errorbar(S,n,xerr=delta_S, yerr=delta_n, 
           fmt='go')
\end{verbatim}
\end{frame}
\begin{frame}[fragile]
\frametitle{Summary}
\label{sec-15}

\begin{verbatim}
  L = [0.1, 0.2, 0.3, 0.4, 0.5,
       0.6, 0.7, 0.8, 0.9]  
  plot(x,y,'o')
  plot(x,y,'.')
\end{verbatim}
\end{frame}
\begin{frame}
\frametitle{Thank you!}
\label{sec-16}

  \begin{block}{}                                                                                                                                            
  \begin{center}                                                                                                                                             
  This spoken tutorial has been produced by the                                                                                                              
  \textcolor{blue}{FOSSEE} team, which is funded by the                                                                                                      
  \end{center}                                                                                                                                               
  \begin{center}                                                                                                                                             
    \textcolor{blue}{National Mission on Education through \\                                                                                                
      Information \& Communication Technology \\                                                                                                             
      MHRD, Govt. of India}.                                                                                                                                 
  \end{center}                                                                                                                                               
  \end{block}                                                                                                                                                
\end{frame}

\end{document}
